Revit 2027 API
FabricationPart.ProductSpecificationDescription Property
 The product specification description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductSpecificationDescription { get; }
Public ReadOnly Property ProductSpecificationDescription As String
	Get
public:
property String^ ProductSpecificationDescription {
	String^ get ();
}
member ProductSpecificationDescription : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace